Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པའི་ལམ་སྟོན་པ་རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ་མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ་འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ་སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ་ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night.

source: སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: These are their thoughts as they look out in wisdom:

source: སུ་ནི་ངས་ངན་སོང་ནས་ཕྱུང་སྟེ། མཐོ་རིས་དང་ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཇི་ལྟར་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་པ་དེ་བཞིན་དུ་ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱང་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་
en: Just as the blessed buddhas regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night—so too the great listeners regard the world with their listener’s eyes six times throughout the day and night—three times by day and three times by night.

source: ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་ལྟ་བར་བྱེད་དེ། ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་བལྟས་ན། སྲིད་པ་ཐ་མ་པའི་སེམས་ཅན་ཞིག་གིས་ཁྱིམ་བདག་དེའི་ཆུང་མ་ཆེན་མའི་ལྟོར་ཉིང་མཚམས་སྦྱར་བར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བསམས་པ།
en: When Venerable Aniruddha regarded the world with his listener’s eyes, he saw a being who was in his final birth taking birth in the home of that householder, and thought,

source: སེམས་ཅན་དེ་སུས་འདུལ་བར་འགྱུར།
en: “Who will tame this being?

source: ཅི་སངས་རྒྱས་ཀྱིས་འདུལ་བར་འགྱུར་རམ་འོན་ཏེ་ཉན་ཐོས་ཀྱིས་འདུལ་བར་འགྱུར་ཞིག་གུ་
en: Will he be tamed by the Buddha, or will he be tamed instead by the listeners?”

source: དེ་བདག་ཉིད་ཀྱིས་འདུལ་བར་འགྱུར་བར་མཐོང་ལ། དེ་ཡང་སྔན་ཅད་ཁྱིམ་དེའི་བསེན་ཡིན་ཏེ
en: Then he saw that it was he himself who would tame him, and since he was already a spiritual friend of the house,

source: དེས་ཁྱིམ་བདག་དེ་བརྟན་པོར་བྱ་བའི་ཕྱིར་ཟླ་མེད་པ་དང་གཡོག་མེད་པར་གཅིག་པུ་ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་སོང་བ་དང་
en: to strengthen the householder’s resolve, he went to the householder’s home alone, without companions or attendants.

source: ཁྱིམ་བདག་དེས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ཟླ་མེད་པ་དང་གཡོག་མེད་པར་གཅིག་པུ་འོང་བ་མཐོང་ངོ་། །
en: The householder saw that Venerable Aniruddha was alone, without companions or attendants,

source: འཕགས་པ་ཁྱོད་ཟླ་མ་མཆིས་པ་དང་། ཞབས་འབྲིང་མ་མཆིས་པར་གཅིག་པུ་གཤེགས་ན་འཕགས་པའི་ཞབས་འབྲིང་བགྱིད་པ་འགའ་ཡང་མ་མཆིས་སམ་ཞེས་དྲིས་སོ། །
en: and he asked, “Noble one, why have you come here alone, without companions or attendants? Noble one, is there no one at all who could attend you?”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་སྨྲས་པ་
en: replied Venerable Aniruddha.

source: ཁྱེད་ཅག་ལྟ་བུ་འབའ་ཞིག་ལས་རྙེད་པ་མ་གཏོགས་པར་བདག་ཅག་གིས་གུད་ན། གཡོག་ག་ལ་རྙེད་དེ་ཁྱེད་ལས་རྙེད་པ་འབའ་ཞིག་བདག་ཅག་གི་གཡོག་བྱེད་པར་ཟད་དོ། །
en: “Where shall we find attendants, if one such as yourself does not grant them to us?”

source: འཕགས་པ་
en: “Noble one,”

source: བདག་གི་མཆིས་བྲང་ལ་བུ་ཆགས་པ་མཆིས་ཀྱིས། དེ་ལས་གལ་ཏེ་ཁྱེའུ་ཞིག་བཙས་པར་གྱུར་ན། དེ་བདག་གིས་འཕགས་པའི་ཞབས་འབྲིང་དུ་དབུལ་ལོ། །
en: “my wife has conceived, so if we have a son, I shall offer him to you as an attendant.”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་སྨྲས་པ།
en: Venerable Aniruddha said,

source: ཁོང་དགེ་བ་དག་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ནོ་ཞེས་དེ་སྐད་སྨྲས་ནས། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་སོང་ངོ་། །
en: “The virtuous keep their promises,” and having spoken thus, he departed.

source: ཁྱིམ་བདག་དེའི་ཆུང་མ་ཡང་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ། དེའི་ལུས་ཐམས་ཅད་ནས་སྣ་མའི་མེ་ཏོག་གི་དྲིའི་ངད་ལྡང་སྟེ། དེས་ཁྱིམ་དེ་ཐམས་ཅད་སྣ་མའི་མེ་ཏོག་གི་དྲིས་འགེངས་པར་བྱེད་དོ། །
en: After nine or ten months had passed, the householder’s wife gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, and from all over whose body the fragrance of jasmine flowers arose, suffusing the entire house with the scent of jasmine.

source: ཁྱེའུ་དེ་མའི་མངལ་དུ་ཞུགས་པ་དང་བཙས་པའི་ཚེ་ཡང་ཁྱིམ་དེ་ཀུན་དུ་སྣ་མའི་མེ་ཏོག་གི་ཆར་འབབ་བོ། །
en: A rain of jasmine flowers fell all about the house as the child entered his mother’s womb and again at the time of his birth.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས
en: At the elaborate feast celebrating his birth, when they were asked,

source: ཁྱེའུ་འདིའི་མིང་ཅི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: “What name should we give this child?”

source: ཁྱེའུ་འདི་མའི་མངལ་དུ་ཞུགས་པ་དང་བཙས་པའི་ཚེ་ཁྱིམ་དུ་སྣ་མའི་མེ་ཏོག་གི་ཆར་འབབ་པས་ན། དེའི་ཕྱིར་ཁྱེའུ་འདིའི་མིང་སྣ་མའི་མེ་ཏོག་ཅེས་གདགས་སོ། །
en: they named him, saying, “Since a rain of jasmine flowers fell all about the house as the child entered his mother’s womb and again at the time of his birth, his name will be Jasmine .”

source: དེ་ནས་ཁྱེའུ་སྣ་མའི་མེ་ཏོག་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared young Jasmine on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་ཁོང་རྩིས་དང་ཤོད་དགོད་དང་ལག་རྩིས་དང་དབྱུང་བ་དང་སྦ་བ་དང་དགྲམ་པ་དང་གོས་བརྟག་པ་དང་ནོར་བུ་བརྟག་པ་དང་རིན་པོ་ཆེ་བརྟག་པ་དང་སྤོས་བརྟག་པ་དང་སྨན་བརྟག་པ་དང་གླང་པོ་ཆེ་བརྟག་པ་དང་རྟ་བརྟག་པ་དང་གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: As he grew up he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: ཡི་གེ་མཁས་པ་དང་ཀློག་མཁས་པ་དང་མཛངས་པ་དང་བྱ་བ་གསལ་བ་དང་ཡིད་གཞུངས་པ་དང་བརྟག་པ་རྣམ་པ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: He became skilled in writing, skilled at reading, learned, decisive, and industrious, a master of the eight types of examination.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་མ་འགགས་པས། ཁྱེའུ་དེ་རབ་ཏུ་དབྱུང་བའི་དུས་ལ་བབ་པར་མཐོང་ནས།
en: One day Venerable Aniruddha saw that the time had come for the child to go forth.

source: ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་སོང་སྟེ། ཁྱིམ་བདག་ལ་སྨྲས་པ།
en: He went to the householder’s home and reminded him by saying,

source: དེ་ཁོ་ན་ལྟར་དམ་བཅས་ལགས་སོ་
en: “I did make just such a promise.”

source: ཞེས་སྨྲས་ནས། ཁྱེའུ་དེ་ལག་པ་གཉིས་ཀྱིས་བཟུང་སྟེ། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་ཕུལ་ནས་སྨྲས་པ།
en: After he said this, he took the child by his hands, offered him to Venerable Aniruddha, and told him,

source: བུ་ཁྱོད་མ་བཙས་པའི་སྔ་རོལ་ནས། འཕགས་པ་མ་འགགས་པ་ལ་ངས་ཕུལ་གྱིས་སོང་ལ། འཕགས་པའི་ཞབས་འབྲིང་གྱིས་ཤིག །
en: “My child, before you were born, I offered you to the noble one. Therefore go, and be an attendant of the noble one.”

source: དེ་ནི་བདག་ལ་ཕན་གདགས་པ་ལགས་སོ་
en: “This will be of benefit to me,”

source: ཞེས་བྱས་ནས། ཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པའི་ཕྱི་བཞིན་དུ་ཆས་སོ། །
en: and with those words he followed Venerable Aniruddha away.

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཀྱང་། ཁྱིམ་བདག་དེ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་བྱས་ནས། སྟན་ལས་ལངས་ཏེ་སོང་ངོ་། །
en: After Venerable Aniruddha had instructed, encouraged, inspired, and delighted the householder with a discourse on the Dharma, he rose from his seat and departed.

source: དེ་ནས་ཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་གཙུག་ལག་ཁང་དུ་ཁྲིད་ནས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: Having brought the child to the monastery, Venerable Aniruddha led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དབང་པོ་དང་།
en: He achieved the insights, superknowledges, and discriminations. He had no regard for worldly profit, passion, or acclaim.

source: ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་། གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: He became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེ་ཡང་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་ལ། བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་བར་དུ་ཐོབ་པ་ཡིན་ནོ། །
en: He also achieved miraculous abilities and great power, such that he reached the concentrations, liberations, meditative stabilizations, and attainments.

source: དེ་སྙོམས་པར་འཇུག་པ་དང་ལྡང་བ་ལ་མྱུར་ཏེ། ཁབ་ལན་རེ་འཛུགས་པའི་ཡུན་ཙམ་ལ། ཏིང་ངེ་འཛིན་གཞན་དང་གཞན་དག་ལ་སྙོམས་པར་འཇུག་ཅིང་ལྡང་ངོ་། །
en: He could enter and emerge from equipoise quickly, passing from one meditation to the next in the time it takes to thread a needle, and re-emerging just as quickly.

source: དེ་ནས་ཕྱི་ཞིག་ན། ཚེ་དང་ལྡན་པ་སྣ་མའི་མེ་ཏོག་གིས་བསམས་པ།
en: One day Venerable Jasmine thought,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་རྣམ་པ་དུ་མ་ནི་བསལ། བདེ་བ་དང་ཡིད་བདེ་བ་རྣམ་པ་དུ་མ་ནི་བསྒྲུབས། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་ནི་བསལ། དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་ནི་བསྒྲུབས་ན། བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་དྲིན་ཇི་ལྟར་བསབ་པར་བྱ་སྙམ་མོ། །
en: “The Blessed One has dispelled so many kinds of suffering and anguish, brought me many kinds of happiness and bliss, cleared away so many of my sins and nonvirtues, and secured for me such virtues. How could I repay the Blessed One’s kindness?

source: སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་གང་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་སེམས་ཅན་ལ་ཕན་པའི་ཕྱིར་འབྱུང་བར་ཟད་ཀྱིས། མ་ལ་བདག་གིས་ཀྱང་སེམས་ཅན་ལ་ཕན་པར་བྱའོ་སྙམ་མོ། །
en: Anytime a buddha arises in the world, it is only to benefit beings, so surely I too should act for the benefit of beings!”

source: དེ་ནས་དེས་བདག་གིས་གདུལ་བར་འགྱུར་བ་འགའ་ལྟ་ཡོད་དམ་སྙམ་དུ་བསམས་པ་དང་།
en: Reflecting in this way, he wondered, “Whom might I tame?”

source: དེས་ཐོག་མ་ཁོ་ནར་ཕ་མ་གཉིས་མཐོང་ངོ་། །
en: He looked out, and right away he saw his two parents.

source: ཐབས་ཅི་ཞིག་གིས་དེ་གཉིས་འདུལ་བར་འགྱུར་སྙམ་པ་དང་།
en: “But by what method can I tame them?”

source: དེས་རྫུ་འཕྲུལ་གྱིས་འདུལ་བར་རིག་ནས།
en: and he realized he could tame them with a display of miracles.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ། རང་གི་ཁྱིམ་དུ་ཕ་མ་གཉིས་ཀྱི་མདུན་ལོགས་ནས་ས་བརྟོལ་ཏེ་བྱུང་ནས་སྟེང་གི་ནམ་མཁའ་ལ་འདུག་སྟེ།
en: So he disappeared from the garden of Prince Jeta and reappeared at his parents’ house, floating in midair before them.

source: འབར་བ་དང་ལམ་མེར་འདུག་པ་དང་། ཆར་འབེབས་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ནས་བབས་ཏེ། སྟན་བཤམས་པ་ལ་འདུག་གོ། །
en: He made a miraculous display of fire and light, rain and lightning, then descended and took a seat.

source: དེ་འདུག་ནས་ཕ་མ་གཉིས་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: He taught his parents the Dharma particularly suited to them.

source: དེ་ནས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་སྟེ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་གནས་པར་བྱས་ཏེ།
en: Hearing it, the householders and their retinue destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat. He led them to go for refuge and maintain the fundamental precepts.

source: བདེན་པ་མཐོང་ནས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་པར་གྱུར་ཏོ། །
en: Having seen the truths, they gave gifts and made merit.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས། བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: The monks inquired of the Blessed One,

source: བཙུན་པ་སྣ་མའི་མེ་ཏོག་གིས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: “Lord, what action did Venerable Jasmine take that ripened into his birth into a family of great means, prosperity, and wealth;

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ལ། བཙས་མ་ཐག་ཏུ་ཡང་ལུས་ཐམས་ཅད་ནས་སྣ་མའི་མེ་ཏོག་གི་ངད་ལྡང་ཞིང་མངལ་དུ་ཞུགས་པ་དང་བཙས་པའི་ཚེ་ཡང་ཁྱིམ་དུ་སྣ་མའི་མེ་ཏོག་གི་ཆར་བབ་ལ།
en: that he was well proportioned, pleasing to the eye, and beautiful; that at his birth, the scent of jasmine flowers arose from all over his body; that as he entered the womb, a rain of jasmine flowers fell all about the house;

source: འདིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེམི་མཉེས་པར་མ་བགྱིས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་པ་ལགས།
en: and that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?

source: ཕ་མ་གཉིས་ཀྱིས་ཀྱང་ལས་ཅི་བགྱིས་ན། དེས་དེ་ཁོ་ན་ལ་བརྟེན་ནས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: And his parents—what action did they take that, entrusting themselves to him completely, they pleased the Blessed One, and did not displease him?”

source: སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བ་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ། ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས།
en: there lived in Vārāṇasī a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཆུང་མ་བླངས་ནསདེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: “When the time came for him to marry he took a wife, and as they enjoyed themselves and coupled, one day his wife conceived.

source: དེས་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་སོ། །
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་ནས་དེ་ཆེར་སྐྱེས་པ་དང་། དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས།
en: “As he grew up he found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དེས་ཕ་མ་ལ་གསོལ་ཏེ། རབ་ཏུ་བྱུང་ངོ་། །
en: He asked for his parents’ permission and went forth.

source: རབ་ཏུ་བྱུང་ནས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ། རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་གྱུར་ནས་
en: After going forth, he studied the Tripiṭaka and became a proponent of the Dharma with all the eloquence of his wisdom and freedom.

source: དེས་ཕ་མ་གཉིས་དད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་བཀོད་དེ། སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་གནས་པར་བྱས་སོ། །སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའ་ལ་ཡང་བཙུད་དོ། །
en: He led his parents to live a life of perfect faith, and to go for refuge and maintain the fundamental precepts, and he inspired them to give gifts and to share what they had.

source: ཕྱི་ཞིག་ན་དེས་བསམས་པ།
en: “One day he thought,

source: བདག་གིས་ཐོས་པའི་སྒོ་ནས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་བདག་གིས་བྱས་ཟིན་གྱིས། མ་ལ་ད་ནི་བདག་གིས་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱའོ་
en: ‘I have completed whatever educational duties were before me. Now let me serve the saṅgha!’

source: སྙམ་དུ་བསམས་ནསཕ་མ་གཉིས་དང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་གཞན་དག་ལ་བསྐུལ་ཏེ། དགེ་འདུན་ལ་འབྲས་ཆན་དང་ཐུག་པ་བཏུང་བ་དང་སྐྱོ་མ་རྣམས་དང་གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་ཕུལ་ལོ། །ཁབ་ཀྱང་ཕུལ་ལོ། །
en: With this thought he called upon his parents, the brahmins, and others of faith, and they offered the saṅgha cooked rice, soup, drink, porridge, and provisions such as clothing, food, bedding, seats, and medicines for the sick, and they offered them residences as well.

source: དེ་བཞིན་དུ་དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་རྣམས་ལ་ཡང་ཏིལ་མར་གྱིས་བྱུག་པ་དང་སྤོས་ཀྱིས་བྱུག་པ་དང་།
en: “He anointed all the stūpas containing hair and nail relics with an unguent of sesame oil and fragrant ointments;

source: མར་མེའི་ཕྲེང་བ་དང་སྣ་མའི་མེ་ཏོག་གི་ཕྲེང་བ་དང་གདུགས་ཀྱང་ཕུལ་སྣ་མའི་མེ་ཏོག་གི་སིལ་མས་ཀྱང་གཏོར་ནས
en: offered rows of butter lamps, garlands of jasmine flowers, and parasols; and scattered loose jasmine petals over them.

source: སྨོན་ལམ་བཏབ་པ།
en: “Then he prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་ཤོག་ཅིག །
en: May I be well proportioned, pleasing to the eye, and beautiful.

source: བདག་གི་ལུས་ཐམས་ཅད་ནས་ཀྱང་སྣ་མའི་མེ་ཏོག་གི་དྲིའི་ངད་ལྡང་བར་ཤོག་ཅིག །
en: From all over my body may the fragrance of jasmine flowers arise.

source: མངལ་དུ་ཞུགས་པ་དང་བཙས་པའི་ཚེ་ཡང་བདག་གི་ཁྱིམ་དུ་སྣ་མའི་མེ་ཏོག་གི་ཆར་འབབ་པར་ཤོག་ཅིག །
en: As I enter my mother’s womb, may a rain of jasmine flowers also fall all about the house.

source: ཤེས་རབ་ཀྱང་རྣོ་བར་གྱུར་ཅིག །
en: “ ‘May I have a sharp intellect.

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱང་ཐོབ་སྟེ།
en: May I attain the concentrations, liberations, meditative stabilization , and attainments.

source: སྙོམས་པར་འཇུག་པ་དང་ལྡང་བ་ལ་མྱུར་བར་གྱུར་ཅིག །ཁབ་ལན་རེ་འཛུགས་པའི་ཡུན་ཙམ་ལ་ཡང་། ཏིང་ངེ་འཛིན་གཞན་དང་། གཞན་དག་ལ་སྙོམས་པར་འཇུག་ཅིང་ལྡང་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I enter and emerge from equipoise quickly, passing from one meditation to the next in the time it takes to thread a needle, and re-emerging just as quickly.’

source: དེ་ནས་ཕ་མ་གཉིས་ཀྱིས་དེ་མཐོང་ནས་དྲིས་པ།
en: As they saw him sitting there praying his parents asked,

source: བུ་ཁྱོད་ཀྱིས་སྨོན་ལམ་ཅི་ཞིག་བཏབ།
en: ‘Child, what prayers are you making?’

source: དེས་དེ་གཉིས་ལ་བདག་གིས་སྨོན་ལམ་འདི་ལྟར་བཏབ་པོ་ཞེས་ཐམས་ཅད་བསྙད་དོ། །
en: “ ‘I prayed like this . . .’ he told them, and related it all in detail.

source: ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ། ཁྱོད་ཁོ་ན་བདག་ཅག་གཉིས་ཀྱི་བུར་གྱུར་ཅིག །
en: His parents said, ‘May you alone again become our son.

source: བདག་ཅག་གཉིས་ཀྱང་ཁྱོད་ཀྱི་ཕ་མར་གྱུར་ཅིག །
en: May the two of us again become your parents.

source: ཁྱོད་ཁོ་ན་ལ་བརྟེན་ཏེ་བདག་ཅག་གཉིས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Entrusting ourselves to you completely, may we please and not displease the Blessed Buddha.’

source: དེའི་ཚེ་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་སྣ་མའི་མེ་ཏོག་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that monk then is none other than Jasmine now.

source: དེ་དེར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་ཏེ།
en: At that time he went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa and rendered service in accord with the Dharma.

source: སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་ལ་བཀུར་སྟི་བྱས་ནས། སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: He served the Buddha, Dharma, and Saṅgha with respect, and the act of praying ripened such that wherever he was born it was into a family of great means, prosperity, and wealth;

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ལ་བཙས་མ་ཐག་ཏུ་ཡང་དེའི་ལུས་ཐམས་ཅད་ནས།
en: he was well proportioned, pleasing to the eye, and beautiful;

source: སྣ་མའི་མེ་ཏོག་གི་དྲིའི་ངད་ལྡང་བར་གྱུར་པ་དང་། མངལ་དུ་ཞུགས་པ་དང་། བཙས་པའི་ཚེ་ཡང་དེའི་ཁྱིམ་དུ་སྣ་མའི་མེ་ཏོག་གི་ཆར་ཕབ་སྟེ
en: from all over his body the fragrance of jasmine flowers arose; and a rain of flowers fell all about the house as he entered his mother’s womb, and again at the time of his birth.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་རྙེད་པར་གྱུར་ནས། འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ལ་
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship;

source: ཤེས་རབ་རྣོ་བར་གྱུར་ཏེ།
en: that his intellect became sharp;

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ཐོབ་ནས།
en: that that he reached the concentrations, liberations, meditative stabilizations, and attainments;

source: སྙོམས་པར་འཇུག་པ་དང་ལྡང་བ་ལ་མྱུར་བར་གྱུར་ཏེ། ཁབ་ལན་རེ་འཛུགས་པའི་ཡུན་ཙམ་ལ་ཡང་ཏིང་ངེ་འཛིན་གཞན་དང་། གཞན་དག་ལ་སྙོམས་པར་འཇུག་ཅིང་ལྡང་བར་བྱེད་དོ། །
en: and that he can enter and emerge from equipoise quickly, passing from one meditation to the next in the time it takes to thread a needle, and re-emerging just as quickly.

source: དེའི་ཚེ་ཕ་མར་གྱུར་པ་དེ་གཉིས་ནི། ཕ་མ་འདི་གཉིས་ཡིན་ཏེ།
en: “The ones who were his parents then are none other than his parents now.

source: དེ་གཉིས་ཀྱིས་དེར་སྨོན་ལམ་བཏབ་སྟེ།
en: At that time they prayed,

source: ཁྱོད་ཁོ་ན་ལ་བརྟེན་ནས། བདག་ཅག་གཉིས་ཀྱིས་ཤཱཀྱའི་རྒྱལ་པོ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘Entrusting ourselves to you completely, may we please and not displease the king of the Śākyas,’

source: ཅེས་བྱས་པས་ད་ལྟར་འདི་ཁོ་ན་ལ་བརྟེན་ཏེ། འདི་གཉིས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: and now, entrusting themselves to him completely, they have pleased me, and not displeased me.”

source: ང་ལ་བྱིན་ཞེས་བྱ་བ་ནི།
en: Give It to Me!

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ་ལྷུང་བཟེད་བསྣམས་ནས། མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་གཤེགས་པ་ལས།
en: One morning when the Blessed One was in Śrāvastī he donned his lower garment and Dharma robes, and, carrying his alms bowl, went for alms.

source: དེར་བཅོམ་ལྡན་འདས་ལ། ཁྱིམ་བདག་ཅིག་གིས་རོ་བརྒྱ་དང་ལྡན་པའི་ལ་དུ་འགྲངས་ཚད་ཅིག་ཕུལ་བ་དང་། དེའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་ཞིག །བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་ཐག་མི་རིང་བ་ཞིག་ན་འགྲེང་སྟེ།
en: A little brahmin child stood not far from the Blessed One and watched as a householder offered a laḍḍū treat of a hundred flavors, big enough to fill his stomach.

source: བཅོམ་ལྡན་འདས་ལ་ཁྱིམ་བདག་དེས་རོ་བརྒྱ་དང་ལྡན་པའི་ལ་དུ་འགྲངས་ཚད་ཅིག་ཕུལ་བ་བྲམ་ཟེའི་ཁྱེའུ་དེས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བྲམ་ཟེའི་ཁྱེའུ་དེ། ལ་དུ་དེ་ལ་ཆགས་པ་སྐྱེས་ནས། དེ་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་ནས་སྨྲས་པ།
en: When the brahmin child saw the laḍḍū treat, great craving arose in him for it, and he approached the Blessed One and said,

source: ཀྱེ་གཽ་ཏ་མ། ལ་དུ་འོ་ནི་ང་ལ་བྱིན་ཅིག་ཅེས་བྱས་སོ། །
en: “Hey Gautama, gimme that laḍḍū!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། བྲམ་ཟེའི་ཁྱེའུ་དེ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One answered the brahmin child,

source: ཁྱེའུ་གལ་ཏེ་ཁྱོད་ཀྱིས་འདི་སྐད་དུ། ལ་དུ་འདི་བདག་ལ་མི་དགོས་སོ་ཞེས་བྱས་ན་ནི་དེའི་འོག་ཏུ་ངས་སྦྱིན་ནོ། །
en: “Child, if you say, ‘I don’t need that laḍḍū treat,’ I’ll hand it over.”

source: དེ་ནས་དེས་ཀྱེ་གཽ་ཏ་མ་ལ་དུ་འདི་བདག་ལ་མི་དགོས་ས་ཞེས་སྨྲས་སོ། །
en: So he said to Gautama, “Hey Gautama, I don’t need that laḍḍū treat,”
